open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_coord_ap.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_pm_coord_ap.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * AP half of the BK7258 v3.1.1.9 coordinated low-voltage protocol.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_PM_COORDINATED_STANDBY

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/arch.h>
#include <nuttx/cache.h>
#include <nuttx/power/pm.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_console.h>
#include <arch/chip/bk7258_rptun.h>

#include "arm_internal.h"
#include "nvic.h"
#include "bk7258_pm_coord.h"
#include "bk7258_rptun_mbox.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_SYS_BASE                 0x44010000u
#define BK7258_SYS_CPU1_EN_LOW          (BK7258_SYS_BASE + 0x88u)
#define BK7258_SYS_CPU1_EN_HIGH         (BK7258_SYS_BASE + 0x8cu)
#define BK7258_SYS_CPU2_EN_LOW          (BK7258_SYS_BASE + 0x90u)
#define BK7258_SYS_CPU2_EN_HIGH         (BK7258_SYS_BASE + 0x94u)
#define BK7258_SYS_CPU1_STATUS_LOW      (BK7258_SYS_BASE + 0xa8u)
#define BK7258_SYS_CPU1_STATUS_HIGH     (BK7258_SYS_BASE + 0xacu)
#define BK7258_SYS_CPU2_STATUS_LOW      (BK7258_SYS_BASE + 0xb0u)
#define BK7258_SYS_CPU2_STATUS_HIGH     (BK7258_SYS_BASE + 0xb4u)

#define BK7258_NVIC_PENDING0            0xe000e200u
#define BK7258_NVIC_PENDING1            0xe000e204u
#define BK7258_NVIC_ICSR                0xe000ed04u
#define BK7258_NVIC_ICSR_PENDSTSET      (1u << 26)
#define BK7258_SYSTICK_CTRL             0xe000e010u
#define BK7258_MAILBOX_WAKE_BIT         (1u << 31)

#define BK7258_AP_LOGICAL_CPU0          0u
#define BK7258_AP_LOGICAL_CPU1          1u
#define BK7258_PM_AP_PEER_WAIT_US       1000u

#define BK7258_PM_AP_DIAG_MAGIC         0x44415042u /* "BPAD" */
#define BK7258_PM_AP_DIAG_VERSION       2u
#define BK7258_PM_AP_TRACE_MAGIC        0x54504142u /* "BAPT" */
#define BK7258_PM_AP_TRACE_VERSION      1u

#define BK7258_PM_AP_TRACE_RUNTIME      (1u << 0)
#define BK7258_PM_AP_TRACE_IDLE         (1u << 1)
#define BK7258_PM_AP_TRACE_DEEP         (1u << 2)
#define BK7258_PM_AP_TRACE_PENDING_OK   (1u << 3)
#define BK7258_PM_AP_TRACE_VOTE_OK      (1u << 4)
#define BK7258_PM_AP_TRACE_AON_SET      (1u << 5)
#define BK7258_PM_AP_TRACE_WAKE         (1u << 6)
#define BK7258_PM_AP_TRACE_PENDING_REJ  (1u << 7)
#define BK7258_PM_AP_TRACE_VOTE_REJ     (1u << 8)
#define BK7258_PM_AP_TRACE_PEER_SEEN    (1u << 9)
#define BK7258_PM_AP_TRACE_PEER_TIMEOUT (1u << 10)
#define BK7258_PM_AP_TRACE_IPI_ISR      (1u << 11)
#define BK7258_PM_AP_TRACE_IPI_VOTE     (1u << 12)

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

/* The DMA status query and SDK callback dispatcher are optional archive
 * leaves.  Production profiles which initialize those SDK subsystems pull
 * them in; a profile without either subsystem has no corresponding work or
 * callback to drain.
 */

extern uint32_t bk_dma_check_chn_status(void) weak_function;
extern void bk_pm_handle_lv_sleep_callback(int state) weak_function;
extern int up_send_smp_sched(int cpu);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct bk7258_pm_ap_diag_s
{
  uint32_t magic;
  uint16_t version;
  uint16_t size;
  uint32_t idle_entries[2];
  uint32_t shallow_vote_wakes[2];
  uint32_t deep_entries[2];
  uint32_t pending_rejects[2];
  uint32_t vote_rejects[2];
  uint32_t aon_sets[2];
  uint32_t wakeups[2];
  uint32_t forward_attempts;
  int32_t forward_last_ret;
  uint32_t last_nvic_pending[2];
  uint32_t last_sys_status[2];
  uint32_t last_dma;
  uint32_t last_icsr;
  uint32_t prepare_waits;
  uint32_t prepare_takes;
};

volatile struct bk7258_pm_ap_diag_s g_bk7258_pm_ap_diag;

/* BK7258 AP cores have private, non-coherent D-caches.  Keep each core's
 * trace in a distinct cache-line-aligned object and let only that core write
 * and clean it.  The trace is observational; coordination still uses AON and
 * the physical mailbox exclusively.
 */

struct bk7258_pm_ap_core_trace_s
{
  uint32_t magic;
  uint16_t version;
  uint16_t size;
  uint32_t stages;
  uint32_t idle_entries;
  uint32_t deep_entries;
  uint32_t pending_rejects;
  uint32_t vote_rejects;
  uint32_t aon_sets;
  uint32_t wakeups;
  uint32_t peer_waits;
  uint32_t peer_timeouts;
  uint32_t last_nvic_pending[2];
  uint32_t last_sys_status[2];
  uint32_t last_dma;
  uint32_t last_icsr;
  uint32_t reserved[6];
} aligned_data(32);

volatile struct bk7258_pm_ap_core_trace_s g_bk7258_pm_ap_core_trace[2]
  aligned_data(32);

struct bk7258_pm_ap_irq_sleep_s
{
  bool armed;
  uint32_t systick;
  uint32_t int_low;
  uint32_t int_high;
};

/* AP1 does not have a local SysTick and its qualified scheduler can replace
 * the bootstrap idle exception frame before the CP vote arrives.  Keep the
 * exception-tail sleep state in AP1's private cache; AON remains the protocol
 * truth visible to CP and AP0.
 */

static struct bk7258_pm_ap_irq_sleep_s g_bk7258_pm_ap_irq_sleep;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static inline uint32_t bk7258_pm_local_cpu(void)
{
  return *(volatile uint32_t *)(uintptr_t)BK7258_LOCAL_CORE_ID_ADDR;
}

static void bk7258_pm_ap_diag_publish(void)
{
  __asm volatile ("dmb sy" ::: "memory");
  up_clean_dcache((uintptr_t)&g_bk7258_pm_ap_diag,
                  (uintptr_t)&g_bk7258_pm_ap_diag +
                  sizeof(g_bk7258_pm_ap_diag));
}

static void bk7258_pm_ap_trace_publish(uint32_t cpu)
{
  uintptr_t start =
    (uintptr_t)&g_bk7258_pm_ap_core_trace[cpu];

  (void)start;
  __asm volatile ("dmb sy" ::: "memory");
  up_clean_dcache(start, start + sizeof(g_bk7258_pm_ap_core_trace[cpu]));
}

static void bk7258_pm_ap_trace_mark(uint32_t cpu, uint32_t stage)
{
  volatile struct bk7258_pm_ap_core_trace_s *trace;

  if (cpu > BK7258_AP_LOGICAL_CPU1)
    {
      return;
    }

  trace = &g_bk7258_pm_ap_core_trace[cpu];
  if ((trace->stages & stage) == 0)
    {
      trace->stages |= stage;
      bk7258_pm_ap_trace_publish(cpu);
    }
}

static inline void bk7258_pm_shallow_wfi(void)
{
  irqstate_t flags = up_irq_save();

  modifyreg32(NVIC_SYSCON, NVIC_SYSCON_SLEEPDEEP, 0);
  up_irq_enable();
  __asm volatile ("dsb sy; wfi; isb sy" ::: "memory");
  up_irq_restore(flags);
}

