open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_coord_ap.c
static inline void bk7258_pm_ap_deep_sleep(void)
{
  uint8_t basepri = getbasepri();
  uint8_t primask = getprimask();

  /* The official AP FreeRTOS SMP port enters sys_hal_enter_normal_sleep()
   * with PRIMASK set and BASEPRI clear.  NuttX pm_idle() instead reaches the
   * board hook with BASEPRI raised.  STAR does not leave deep WFI for the
   * PWC mailbox interrupt while that interrupt is masked by BASEPRI, which
   * strands AP0 after CP has otherwise completed the low-voltage restore.
   *
   * Translate only the interrupt-mask representation at the WFI boundary,
   * exactly as the CP wrapper does for the vendor low-voltage leaf.  A
   * PRIMASK-masked mailbox request releases WFI without running the callback
   * inside this critical section; restoring the incoming NuttX masks lets
   * the callback run through the normal interrupt exit path afterwards.
   */

  setprimask(1);
  setbasepri(0);
  modifyreg32(NVIC_SYSCON, 0, NVIC_SYSCON_SLEEPDEEP);
  __asm volatile ("dsb sy; isb sy; wfi; isb sy" ::: "memory");

  setprimask(1);
  setbasepri(basepri);
  setprimask(primask);
  __asm volatile ("isb sy" ::: "memory");
}

static inline bool bk7258_pm_ap_pending(uint32_t cpu,
                                        uintptr_t status_low,
                                        uintptr_t status_high)
{
  volatile struct bk7258_pm_ap_core_trace_s *trace =
    &g_bk7258_pm_ap_core_trace[cpu];
  uint32_t dma = 0;
  uint32_t nvic0;
  uint32_t nvic1;
  uint32_t sys0;
  uint32_t sys1;
  uint32_t icsr;

  if (bk_dma_check_chn_status != NULL)
    {
      dma = bk_dma_check_chn_status();
    }

  nvic0 = getreg32(BK7258_NVIC_PENDING0);
  nvic1 = getreg32(BK7258_NVIC_PENDING1);
  sys0 = getreg32(status_low);
  sys1 = getreg32(status_high);
  icsr = getreg32(BK7258_NVIC_ICSR);
  g_bk7258_pm_ap_diag.last_nvic_pending[0] = nvic0;
  g_bk7258_pm_ap_diag.last_nvic_pending[1] = nvic1;
  g_bk7258_pm_ap_diag.last_sys_status[0] = sys0;
  g_bk7258_pm_ap_diag.last_sys_status[1] = sys1;
  g_bk7258_pm_ap_diag.last_dma = dma;
  g_bk7258_pm_ap_diag.last_icsr = icsr;
  trace->last_nvic_pending[0] = nvic0;
  trace->last_nvic_pending[1] = nvic1;
  trace->last_sys_status[0] = sys0;
  trace->last_sys_status[1] = sys1;
  trace->last_dma = dma;
  trace->last_icsr = icsr;

  return nvic0 != 0 || nvic1 != 0 || dma != 0 || sys0 != 0 ||
         sys1 != 0 || (icsr & BK7258_NVIC_ICSR_PENDSTSET) != 0;
}

static void bk7258_pm_aon_update(uint32_t set, uint32_t clear)
{
  irqstate_t flags;
  uint32_t value;

  /* Match the SDK bitfield setter with a local interrupt-protected RMW.  AP1
   * publishes its sleep vote before AP0 and AP0 withdraws its vote before
   * releasing AP1, so the two cores never update this device word at the
   * same time.  A shared RAM spinlock cannot provide that guarantee across
   * the AP cores' private, non-coherent caches.
   */

  flags = up_irq_save();
  value = getreg32(BK7258_AON_PMU_R3_ADDR);
  value &= ~clear;
  value |= set;
  putreg32(value, BK7258_AON_PMU_R3_ADDR);
  __asm volatile ("dmb sy" ::: "memory");
  up_irq_restore(flags);
}

static bool bk7258_pm_ap_wait_aon(uint32_t bit, bool asserted)
{
  unsigned int elapsed;

  for (elapsed = 0; elapsed < BK7258_PM_AP_PEER_WAIT_US; elapsed++)
    {
      bool state = (getreg32(BK7258_AON_PMU_R3_ADDR) & bit) != 0;

      if (state == asserted)
        {
          return true;
        }

      up_udelay(1);
    }

  return false;
}

static void bk7258_pm_ap_count_wake(uint32_t cpu)
{
  uintptr_t addr = BK7258_PWR_MNG_ADDR +
                   (cpu == BK7258_AP_LOGICAL_CPU0 ?
                    BK7258_PWR_WAKE_AP1_OFFSET :
                    BK7258_PWR_AP1_DEBUG_OFFSET);

  putreg32(getreg32(addr) + 1u, addr);
}

static void bk7258_pm_ap_deep_wfi(uint32_t cpu)
{
  volatile struct bk7258_pm_ap_core_trace_s *trace =
    &g_bk7258_pm_ap_core_trace[cpu];
  uintptr_t en_low;
  uintptr_t en_high;
  uintptr_t status_low;
  uintptr_t status_high;
  uint32_t aon_bit;
  uint32_t int_low;
  uint32_t int_high;
  uint32_t systick;
  unsigned int i;

  g_bk7258_pm_ap_diag.deep_entries[cpu]++;
  trace->deep_entries++;
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_DEEP);

  if (cpu == BK7258_AP_LOGICAL_CPU0)
    {
      en_low = BK7258_SYS_CPU1_EN_LOW;
      en_high = BK7258_SYS_CPU1_EN_HIGH;
      status_low = BK7258_SYS_CPU1_STATUS_LOW;
      status_high = BK7258_SYS_CPU1_STATUS_HIGH;
      aon_bit = BK7258_AON_AP0_WFI_BIT;
    }
  else
    {
      en_low = BK7258_SYS_CPU2_EN_LOW;
      en_high = BK7258_SYS_CPU2_EN_HIGH;
      status_low = BK7258_SYS_CPU2_STATUS_LOW;
      status_high = BK7258_SYS_CPU2_STATUS_HIGH;
      aon_bit = BK7258_AON_AP1_WFI_BIT;
    }

  /* The SDK PWC mailbox used by CP wakes AP0.  FreeRTOS periodically brings
   * AP1 through its idle hook inside the official three-millisecond vote
   * window, but NuttX's ten-millisecond SysTick does not guarantee that.
   * Forward the vote edge through the existing SMP scheduler IPI before AP0
   * masks its interrupt sources so AP1 performs its own pending/DMA checks
   * and publishes its AON WFI acknowledgement in the same attempt.
   */

  if (cpu == BK7258_AP_LOGICAL_CPU0)
    {
#if defined(CONFIG_BK7258_UART0) || defined(CONFIG_BK7258_UART1) || \
    defined(CONFIG_BK7258_UART2)
      /* The packaged SDK has UART low-voltage backup disabled.  Drain every
       * NuttX-owned UART before AP0 starts the shared standby transition;
       * the matching restore runs after the SDK wake callbacks below.
       */

      if (bk7258_uart_pm_prepare() < 0)
        {
          return;
        }
#endif

      g_bk7258_pm_ap_diag.forward_attempts++;
      g_bk7258_pm_ap_diag.forward_last_ret =
        up_send_smp_sched(BK7258_AP_LOGICAL_CPU1);

      /* AON R3 is one device word updated by both AP cores through RMW
       * bitfield setters.  AP1 must publish first; otherwise simultaneous
       * AP0/AP1 writes can lose one WFI bit even though both cores entered
       * the wrapper.  This bounded wait remains inside CP's 3 ms deadline.
       */

