open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_coord_ap.c
      trace->peer_waits++;
      if (!bk7258_pm_ap_wait_aon(BK7258_AON_AP1_WFI_BIT, true))
        {
          trace->peer_timeouts++;
          bk7258_pm_ap_trace_mark(cpu,
                                  BK7258_PM_AP_TRACE_PEER_TIMEOUT);
          return;
        }

      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_PEER_SEEN);
    }

  systick = getreg32(BK7258_SYSTICK_CTRL);
  putreg32(0, BK7258_SYSTICK_CTRL);
  int_low = getreg32(en_low);
  int_high = getreg32(en_high);
  putreg32(0, en_low);
  putreg32(0, en_high);

  for (i = 0; i < 5; i++)
    {
      __asm volatile ("nop");
    }

  if (bk7258_pm_ap_pending(cpu, status_low, status_high))
    {
      g_bk7258_pm_ap_diag.pending_rejects[cpu]++;
      trace->pending_rejects++;
      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_PENDING_REJ);
      bk7258_pm_ap_diag_publish();
      putreg32(int_low, en_low);
      putreg32(int_high, en_high);
      putreg32(systick, BK7258_SYSTICK_CTRL);
      return;
    }

  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_PENDING_OK);

  if ((getreg32(BK7258_AON_PMU_R3_ADDR) &
       BK7258_AON_CP_SLEEP_VOTE_BIT) == 0)
    {
      g_bk7258_pm_ap_diag.vote_rejects[cpu]++;
      trace->vote_rejects++;
      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_VOTE_REJ);
      bk7258_pm_ap_diag_publish();
      putreg32(int_low, en_low);
      putreg32(int_high, en_high);
      putreg32(systick, BK7258_SYSTICK_CTRL);
      return;
    }

  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_VOTE_OK);

  /* Match the official protocol: all normal SYS sources stay masked while
   * the core is in SLEEPDEEP; only the physical-core mailbox can wake it.
   */

  putreg32(BK7258_MAILBOX_WAKE_BIT, en_high);
  if (cpu == BK7258_AP_LOGICAL_CPU0 &&
      bk_pm_handle_lv_sleep_callback != NULL)
    {
      bk_pm_handle_lv_sleep_callback(0); /* PM_LV_ENTER_SLEEP */
    }

  bk7258_pm_aon_update(aon_bit, 0);
  g_bk7258_pm_ap_diag.aon_sets[cpu]++;
  trace->aon_sets++;
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_AON_SET);
  bk7258_pm_ap_diag_publish();
  bk7258_pm_ap_count_wake(cpu);
  bk7258_pm_ap_deep_sleep();

  /* Follow the SDK resume order exactly: withdraw the local AON vote and
   * restore local timer/callback state before sending the peer RELEASE IPI.
   * Waiting for AP1 here is both unnecessary and unsafe because up_udelay()
   * has no guaranteed running timebase immediately after low-voltage wake.
   * Clearing AP0 first and only then releasing AP1 also serializes the two
   * AON R3 read-modify-write clears.
   */

  bk7258_pm_aon_update(0, aon_bit);
  g_bk7258_pm_ap_diag.wakeups[cpu]++;
  trace->wakeups++;
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_WAKE);
  bk7258_pm_ap_diag_publish();

  putreg32(systick, BK7258_SYSTICK_CTRL);
  if (cpu == BK7258_AP_LOGICAL_CPU0 &&
      bk_pm_handle_lv_sleep_callback != NULL)
    {
      bk_pm_handle_lv_sleep_callback(1); /* PM_LV_EXIT_SLEEP */
    }

#if defined(CONFIG_BK7258_UART0) || defined(CONFIG_BK7258_UART1) || \
    defined(CONFIG_BK7258_UART2)
  if (cpu == BK7258_AP_LOGICAL_CPU0)
    {
      /* Run after the SDK exit callbacks so the chip lower-half is the final
       * owner of UART format, FIFO, interrupt, and enable state.
       */

      bk7258_uart_pm_restore();
    }
#endif

  /* The SDK uses vPortYieldCore() after restoring the local wake state.
   * NuttX's scheduler IPI is the equivalent explicit peer RELEASE edge.
   */

  if (cpu == BK7258_AP_LOGICAL_CPU0)
    {
      (void)up_send_smp_sched(BK7258_AP_LOGICAL_CPU1);
    }
  else
    {
      (void)up_send_smp_sched(BK7258_AP_LOGICAL_CPU0);
    }

  putreg32(int_low, en_low);
  putreg32(int_high, en_high);
}

static int bk7258_pm_ap_prepare(struct pm_callback_s *callback, int domain,
                                enum pm_state_e state)
{
  (void)callback;
  (void)domain;

  return state == PM_NORMAL || state == PM_IDLE ||
         state == PM_STANDBY || state == PM_RESTORE ? OK : -EBUSY;
}

static void bk7258_pm_ap_notify(struct pm_callback_s *callback, int domain,
                                enum pm_state_e state)
{
  (void)callback;
  (void)domain;
  (void)state;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

bool bk7258_pm_ap_runtime_ready(void)
{
  volatile struct bk7258_ap_boot_state_s *boot = bk7258_ap_boot_state();
  volatile struct bk7258_rptun_control_s *rptun =
    bk7258_rptun_control();
  uint32_t cpu = bk7258_pm_local_cpu();

  /* CPU1 can retain the cold-start copy of the cacheable shared boot/RPTUN
   * records after CPU0 reaches READY.  Do not invalidate those records here:
   * CPU1 may also own dirty heartbeat fields in the same cache lines.  The
   * CP sleep vote is an uncached hardware authorization and is published only
   * after CP has independently verified AP READY, RPTUN CONNECTED, idle votes,
   * mailbox quiescence and pending IRQ state.  It therefore also provides the
   * safe, immediate gate that brings CPU1 into this coordinated attempt.
   */

  if ((getreg32(BK7258_AON_PMU_R3_ADDR) &
       BK7258_AON_CP_SLEEP_VOTE_BIT) != 0)
    {
      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_RUNTIME);
      return true;
    }

  __asm volatile ("dmb sy" ::: "memory");
  return boot->magic == BK7258_AP_BOOT_STATE_MAGIC &&
         boot->state == BK7258_AP_STATE_READY && boot->error == 0 &&
         rptun->magic == BK7258_RPTUN_CONTROL_MAGIC &&
         rptun->version == BK7258_RPTUN_CONTROL_VERSION &&
         rptun->size == sizeof(*rptun) &&
         rptun->generation == boot->generation &&
         rptun->state == BK7258_RPTUN_STATE_CONNECTED;
}

bool bk7258_pm_ap_release_peer(void)
{
  uint32_t aon;

  if (bk7258_pm_local_cpu() != BK7258_AP_LOGICAL_CPU0)
    {
      return false;
    }

  aon = getreg32(BK7258_AON_PMU_R3_ADDR);
  if ((aon & BK7258_AON_CP_SLEEP_VOTE_BIT) != 0)
    {
      return false;
    }

  if ((aon & BK7258_AON_AP1_WFI_BIT) == 0)
    {
      return true;
    }

  /* Match the SDK's bounded vPortYieldCore(1) retry semantically.  The
   * existing one-millisecond mailbox-worker poll supplies the bound between
   * attempts; completion is the uncached AP1 AON WFI bit, not the edge-send
   * return value.  Replay revokes a stale software pending claim first: AP1
   * can otherwise remain in WFI with no hardware mailbox status while every
   * ordinary scheduler retry is incorrectly coalesced.
   */

  (void)bk7258_ap_ipi_replay_smp(BK7258_AP_LOGICAL_CPU1);
  return false;
}

