open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_coord_ap.c
bool bk7258_pm_ap_ipi_kick(int cpu)
{
  volatile struct bk7258_pm_ap_core_trace_s *trace;
  uint32_t aon;
  unsigned int i;

  if (cpu != BK7258_AP_LOGICAL_CPU1)
    {
      return false;
    }

  trace = &g_bk7258_pm_ap_core_trace[cpu];
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_IPI_ISR);
  aon = getreg32(BK7258_AON_PMU_R3_ADDR);

  /* A scheduler IPI from AP0 is the explicit RELEASE wake for AP1.  Clear
   * SLEEPONEXIT before returning from this ISR, withdraw AP1's AON WFI bit,
   * then restore the exact interrupt and SysTick state saved at PREPARE.
   */

  if (g_bk7258_pm_ap_irq_sleep.armed)
    {
      if ((aon & BK7258_AON_CP_SLEEP_VOTE_BIT) != 0)
        {
          bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_IPI_VOTE);
          return true;
        }

      modifyreg32(NVIC_SYSCON,
                  NVIC_SYSCON_SLEEPDEEP | NVIC_SYSCON_SLEEPONEXIT, 0);
      bk7258_pm_aon_update(0, BK7258_AON_AP1_WFI_BIT);
      g_bk7258_pm_ap_diag.wakeups[cpu]++;
      trace->wakeups++;
      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_WAKE);
      putreg32(g_bk7258_pm_ap_irq_sleep.int_low,
               BK7258_SYS_CPU2_EN_LOW);
      putreg32(g_bk7258_pm_ap_irq_sleep.int_high,
               BK7258_SYS_CPU2_EN_HIGH);
      putreg32(g_bk7258_pm_ap_irq_sleep.systick, BK7258_SYSTICK_CTRL);
      g_bk7258_pm_ap_irq_sleep.armed = false;
      bk7258_pm_ap_diag_publish();
      __asm volatile ("dsb sy; isb sy" ::: "memory");
      return true;
    }

  if ((aon & BK7258_AON_CP_SLEEP_VOTE_BIT) == 0)
    {
      return false;
    }

  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_IPI_VOTE);
  g_bk7258_pm_ap_diag.deep_entries[cpu]++;
  trace->deep_entries++;
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_DEEP);

  g_bk7258_pm_ap_irq_sleep.systick = getreg32(BK7258_SYSTICK_CTRL);
  g_bk7258_pm_ap_irq_sleep.int_low =
    getreg32(BK7258_SYS_CPU2_EN_LOW);
  g_bk7258_pm_ap_irq_sleep.int_high =
    getreg32(BK7258_SYS_CPU2_EN_HIGH);
  putreg32(0, BK7258_SYSTICK_CTRL);
  putreg32(0, BK7258_SYS_CPU2_EN_LOW);
  putreg32(0, BK7258_SYS_CPU2_EN_HIGH);

  for (i = 0; i < 5; i++)
    {
      __asm volatile ("nop");
    }

  if (bk7258_pm_ap_pending(cpu, BK7258_SYS_CPU2_STATUS_LOW,
                          BK7258_SYS_CPU2_STATUS_HIGH))
    {
      g_bk7258_pm_ap_diag.pending_rejects[cpu]++;
      trace->pending_rejects++;
      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_PENDING_REJ);
      putreg32(g_bk7258_pm_ap_irq_sleep.int_low,
               BK7258_SYS_CPU2_EN_LOW);
      putreg32(g_bk7258_pm_ap_irq_sleep.int_high,
               BK7258_SYS_CPU2_EN_HIGH);
      putreg32(g_bk7258_pm_ap_irq_sleep.systick, BK7258_SYSTICK_CTRL);
      bk7258_pm_ap_diag_publish();
      return true;
    }

  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_PENDING_OK);
  if ((getreg32(BK7258_AON_PMU_R3_ADDR) &
       BK7258_AON_CP_SLEEP_VOTE_BIT) == 0)
    {
      g_bk7258_pm_ap_diag.vote_rejects[cpu]++;
      trace->vote_rejects++;
      bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_VOTE_REJ);
      putreg32(g_bk7258_pm_ap_irq_sleep.int_low,
               BK7258_SYS_CPU2_EN_LOW);
      putreg32(g_bk7258_pm_ap_irq_sleep.int_high,
               BK7258_SYS_CPU2_EN_HIGH);
      putreg32(g_bk7258_pm_ap_irq_sleep.systick, BK7258_SYSTICK_CTRL);
      bk7258_pm_ap_diag_publish();
      return true;
    }

  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_VOTE_OK);
  putreg32(BK7258_MAILBOX_WAKE_BIT, BK7258_SYS_CPU2_EN_HIGH);
  bk7258_pm_aon_update(BK7258_AON_AP1_WFI_BIT, 0);
  g_bk7258_pm_ap_diag.aon_sets[cpu]++;
  trace->aon_sets++;
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_AON_SET);
  bk7258_pm_ap_count_wake(cpu);
  g_bk7258_pm_ap_irq_sleep.armed = true;
  modifyreg32(NVIC_SYSCON, 0,
              NVIC_SYSCON_SLEEPDEEP | NVIC_SYSCON_SLEEPONEXIT);
  bk7258_pm_ap_diag_publish();
  __asm volatile ("dsb sy; isb sy" ::: "memory");
  return true;
}

void bk7258_pm_ap_idle(void)
{
  uint32_t cpu = bk7258_pm_local_cpu();

  if (cpu > BK7258_AP_LOGICAL_CPU1)
    {
      bk7258_pm_shallow_wfi();
      return;
    }

  g_bk7258_pm_ap_diag.idle_entries[cpu]++;
  g_bk7258_pm_ap_core_trace[cpu].idle_entries++;
  bk7258_pm_ap_trace_mark(cpu, BK7258_PM_AP_TRACE_IDLE);

  if ((getreg32(BK7258_AON_PMU_R3_ADDR) &
       BK7258_AON_CP_SLEEP_VOTE_BIT) == 0)
    {
      bk7258_pm_shallow_wfi();

      /* CP and the AP0 forwarding IPI may have raised the coordinated-sleep
       * vote while this core was inside shallow WFI.  Consume that edge in
       * the same idle invocation; returning to NuttX first can defer AP1's
       * next vote check until its ten-millisecond SysTick, outside the SDK's
       * three-millisecond acknowledgement window.
       */

      if ((getreg32(BK7258_AON_PMU_R3_ADDR) &
           BK7258_AON_CP_SLEEP_VOTE_BIT) == 0)
        {
          return;
        }

      g_bk7258_pm_ap_diag.shallow_vote_wakes[cpu]++;
    }

  /* A shared AON vote can become visible just before the board mailbox edge
   * is delivered.  AP0 must not mask mailbox interrupts and enter deep WFI
   * until the NuttX-owned logical channel has consumed and ACKed the PREPARE
   * command; otherwise CP cannot send the RELEASE edge on an AP1 timeout.
   */

  if (cpu == BK7258_AP_LOGICAL_CPU0 &&
      !bk7258_rptun_mbox_pm_prepare_take())
    {
      g_bk7258_pm_ap_diag.prepare_waits++;

      /* Return through pm_idle() so sched_unlock() can run the pinned
       * mailbox worker.  A second WFI here would keep that worker ready but
       * unscheduled while CP's bounded acknowledgement window expires.
       */

      return;
    }

  if (cpu == BK7258_AP_LOGICAL_CPU0)
    {
      g_bk7258_pm_ap_diag.prepare_takes++;
    }

  bk7258_pm_ap_deep_wfi(cpu);
}

void arm_pminitialize(void)
{
  static struct pm_callback_s callback =
    {
      .prepare = bk7258_pm_ap_prepare,
      .notify = bk7258_pm_ap_notify,
    };
  unsigned int domain;

  memset((void *)(uintptr_t)&g_bk7258_pm_ap_diag, 0,
         sizeof(g_bk7258_pm_ap_diag));
  g_bk7258_pm_ap_diag.magic = BK7258_PM_AP_DIAG_MAGIC;
  g_bk7258_pm_ap_diag.version = BK7258_PM_AP_DIAG_VERSION;
  g_bk7258_pm_ap_diag.size = sizeof(g_bk7258_pm_ap_diag);
  bk7258_pm_ap_diag_publish();

  memset((void *)(uintptr_t)&g_bk7258_pm_ap_core_trace, 0,
         sizeof(g_bk7258_pm_ap_core_trace));
  for (domain = 0; domain < 2; domain++)
    {
      g_bk7258_pm_ap_core_trace[domain].magic =
        BK7258_PM_AP_TRACE_MAGIC;
      g_bk7258_pm_ap_core_trace[domain].version =
        BK7258_PM_AP_TRACE_VERSION;
      g_bk7258_pm_ap_core_trace[domain].size =
        sizeof(g_bk7258_pm_ap_core_trace[domain]);
      bk7258_pm_ap_trace_publish(domain);
    }

  pm_initialize();

  /* The greedy governor returns the first locked state.  Lock every SMP
   * domain at STANDBY so neither per-CPU nor system-domain policy can ever
   * select PM_SLEEP.
   */

  for (domain = 0; domain < CONFIG_PM_NDOMAINS; domain++)
    {
      pm_stay(domain, PM_STANDBY);
    }

  (void)pm_register(&callback);
}

#endif /* CONFIG_BK7258_PM_COORDINATED_STANDBY */
